Revit 2027 API
WireTypeSet.Insert Method
Insert the specified wire type into the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	WireType item
)
Public Overridable Function Insert (
	item As WireType
) As Boolean
public:
virtual bool Insert(
	WireType^ item
)
abstract Insert :
        item : WireType -> bool
override Insert :
        item : WireType -> bool
Parameters
item WireType
The wire type to be inserted into the set.
Return Value
Boolean
Returns whether the wire type was inserted into the set.
See Also
Reference
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace